cmp-client-createorder/bin/wsdl/CMP-7.3.8/wsdl/account/account.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- 
    $Id: //Source_Code/BCC/Dise3G/7.3/8/WebService/Schema/wsdl/account/account.wsdl#1 $
    $Header: //Source_Code/BCC/Dise3G/7.3/8/WebService/Schema/wsdl/account/account.wsdl#1 $
    $DateTime: 2021/03/22 14:14:36 $
    $Author: BuildMaster $
    $File: //Source_Code/BCC/Dise3G/7.3/8/WebService/Schema/wsdl/account/account.wsdl $
    $Revision: #1 $
    (c) Copyright 2007 Martin Dawes Systems Ltd
-->
<definitions targetNamespace="http://mdsuk.com/ws/dise3g/account/definition"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:target="http://mdsuk.com/ws/dise3g/account/definition"
    xmlns:fault="http://mdsuk.com/ws/dise3g/fault/definition">

    <documentation>This Webservice definition encompasses all operations relating to Account
        management. </documentation>

	<import namespace="http://mdsuk.com/ws/dise3g/fault/definition" location="../fault/fault.wsdl"/>

    <types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema"
            xmlns:account="http://mdsuk.com/ws/dise3g/account/dto/service"
            targetNamespace="http://mdsuk.com/ws/dise3g/account/definition"
            elementFormDefault="qualified">
            <import namespace="http://mdsuk.com/ws/dise3g/account/dto/service"
                schemaLocation="../../xsd/accountservice.xsd"/>

            <element name="CreateAccount">
                <complexType>
                    <sequence>
                        <element name="AccountData" type="account:CreateAccountType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="CreateAccountResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:CreateAccountResponseType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="CreateAccountSerialNumber">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:CreateAccountSerialNumberType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="CreateAccountSerialNumberResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:CreateAccountSerialNumberResponseType"/>
                    </sequence>
                </complexType>
            </element>
			
			<element name="SetCustomerPreferences">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:SetCustomerPreferencesType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="SetCustomerPreferencesResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:SetCustomerPreferencesResponseType"/>
                    </sequence>
                </complexType>
            </element>
			
            <element name="QueryAccount">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:QueryAccountType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="QueryAccountResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:QueryAccountResponseType"/>
                    </sequence>
                </complexType>
            </element>
			
			<element name="QueryCustomerPreferences">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:QueryCustomerPreferencesType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="QueryCustomerPreferencesResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:QueryCustomerPreferencesResponseType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="UpdateRecurringPaymentDetails">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:UpdateRecurringPaymentDetailsType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="UpdateRecurringPaymentDetailsResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:UpdateRecurringPaymentDetailsResponseType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="UpdateAccountDetails">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:UpdateAccountDetailsType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="UpdateAccountDetailsResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:UpdateAccountDetailsResponseType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="UpdateAccountSerialNumber">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:UpdateAccountSerialNumberType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="UpdateAccountSerialNumberResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:UpdateAccountSerialNumberResponseType"/>
                    </sequence>
                </complexType>
            </element>

			<element name="QueryNamesForNumbers">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:QueryNamesForNumbersType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="QueryNamesForNumbersResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:QueryNamesForNumbersResponseType"/>
                    </sequence>
                </complexType>
            </element>

            <element name="SetNamesForNumbersList">
            	<complexType>
            		<sequence>
            			<element name="Request" type="account:SetNamesForNumbersListType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="SetNamesForNumbersListResponse">
            	<complexType>
            		<sequence>
            			<element name="Result" type="account:SetNamesForNumbersListResponseType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="RecordBondPayment">
            	<complexType>
            		<sequence>
            			<element name="Request" type="account:RecordBondPaymentType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="RecordBondPaymentResponse">
            	<complexType>
            		<sequence>
            			<element name="Result" type="account:RecordBondPaymentResponseType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="AddRegisteredCard">
            	<complexType>
            		<sequence>
            			<element name="Request" type="account:AddRegisteredCardType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="AddRegisteredCardResponse">
            	<complexType>
            		<sequence>
            			<element name="Result" type="account:AddRegisteredCardResponseType" />
            		</sequence>
            	</complexType>
            </element>
            
            <element name="CancelRegisteredCard">
            	<complexType>
            		<sequence>
            			<element name="Request" type="account:CancelRegisteredCardType" />
            		</sequence>
            	</complexType>
            </element>

            <element name="CancelRegisteredCardResponse">
            	<complexType>
            		<sequence>
            			<element name="Result" type="account:CancelRegisteredCardResponseType" />
            		</sequence>
            	</complexType>
            </element>
            
            <element name="SetAccountSerialNumber">
                <complexType>
                    <sequence>
                        <element name="Request" type="account:SetAccountSerialNumberType"/>
                    </sequence>
                </complexType>
            </element>
            
            <element name="SetAccountSerialNumberResponse">
                <complexType>
                    <sequence>
                        <element name="Result" type="account:SetAccountSerialNumberResponseType"/>
                    </sequence>
                </complexType>
            </element>

        </schema>
    </types>

    <message name="CreateAccountRequest">
        <part name="Parameters" element="target:CreateAccount"/>
    </message>

    <message name="CreateAccountResponse">
        <part name="Parameters" element="target:CreateAccountResponse"/>
    </message>
	
	<message name="SetCustomerPreferencesRequest">
        <part name="Parameters" element="target:SetCustomerPreferences"/>
    </message>

    <message name="SetCustomerPreferencesResponse">
        <part name="Parameters" element="target:SetCustomerPreferencesResponse"/>
    </message>

    <message name="QueryAccountRequest">
        <part name="Parameters" element="target:QueryAccount"/>
    </message>

    <message name="QueryAccountResponse">
        <part name="Parameters" element="target:QueryAccountResponse"/>
    </message>
	
	<message name="QueryCustomerPreferencesRequest">
        <part name="Parameters" element="target:QueryCustomerPreferences"/>
    </message>

    <message name="QueryCustomerPreferencesResponse">
        <part name="Parameters" element="target:QueryCustomerPreferencesResponse"/>
    </message>
    
    <message name="CreateAccountSerialNumberRequest">
        <part name="Parameters" element="target:CreateAccountSerialNumber"/>
    </message>

    <message name="CreateAccountSerialNumberResponse">
        <part name="Parameters" element="target:CreateAccountSerialNumberResponse"/>
    </message>

    <message name="UpdateRecurringPaymentDetailsRequest">
        <part name="Parameters" element="target:UpdateRecurringPaymentDetails"/>
    </message>

    <message name="UpdateRecurringPaymentDetailsResponse">
        <part name="Parameters" element="target:UpdateRecurringPaymentDetailsResponse"/>
    </message>
    
    <message name="UpdateAccountDetailsRequest">
        <part name="Parameters" element="target:UpdateAccountDetails"/>
    </message>

    <message name="UpdateAccountDetailsResponse">
        <part name="Parameters" element="target:UpdateAccountDetailsResponse"/>
    </message>
	
	<message name="UpdateAccountSerialNumberRequest">
        <part name="Parameters" element="target:UpdateAccountSerialNumber"/>
    </message>

    <message name="UpdateAccountSerialNumberResponse">
        <part name="Parameters" element="target:UpdateAccountSerialNumberResponse"/>
    </message>

    <message name="QueryNamesForNumbersRequest">
        <part name="Parameters" element="target:QueryNamesForNumbers"/>
    </message>

    <message name="QueryNamesForNumbersResponse">
        <part name="Parameters" element="target:QueryNamesForNumbersResponse"/>
    </message>

    <message name="SetNamesForNumbersListRequest">
	    <part name="Parameters" element="target:SetNamesForNumbersList"/>
	</message>

	<message name="SetNamesForNumbersListResponse">
	    <part name="Parameters" element="target:SetNamesForNumbersListResponse"/>
	</message>
    
    <message name="RecordBondPaymentRequest">
	    <part name="Parameters" element="target:RecordBondPayment"/>
	</message>

	<message name="RecordBondPaymentResponse">
	    <part name="Parameters" element="target:RecordBondPaymentResponse"/>
	</message>
    
    <message name="AddRegisteredCardRequest">
	    <part name="Parameters" element="target:AddRegisteredCard"/>
	</message>

	<message name="AddRegisteredCardResponse">
	    <part name="Parameters" element="target:AddRegisteredCardResponse"/>
	</message>
	
	<message name="CancelRegisteredCardRequest">
	    <part name="Parameters" element="target:CancelRegisteredCard"/>
	</message>

	<message name="CancelRegisteredCardResponse">
	    <part name="Parameters" element="target:CancelRegisteredCardResponse"/>
	</message>
    
    <message name="SetAccountSerialNumberRequest">
        <part name="Parameters" element="target:SetAccountSerialNumber"/>
    </message>

    <message name="SetAccountSerialNumberResponse">
        <part name="Parameters" element="target:SetAccountSerialNumberResponse"/>
    </message>
    
    <portType name="AccountPortType">
        <operation name="CreateAccount">
            <input message="target:CreateAccountRequest"/>
            <output message="target:CreateAccountResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="CreateAccountSerialNumber">
            <input message="target:CreateAccountSerialNumberRequest"/>
            <output message="target:CreateAccountSerialNumberResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
		<operation name="SetCustomerPreferences">
            <input message="target:SetCustomerPreferencesRequest"/>
            <output message="target:SetCustomerPreferencesResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="QueryAccount">
            <input message="target:QueryAccountRequest"/>
            <output message="target:QueryAccountResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
		<operation name="QueryCustomerPreferences">
            <input message="target:QueryCustomerPreferencesRequest"/>
            <output message="target:QueryCustomerPreferencesResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="UpdateRecurringPaymentDetails">
            <input message="target:UpdateRecurringPaymentDetailsRequest"/>
            <output message="target:UpdateRecurringPaymentDetailsResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="UpdateAccountDetails">
            <input message="target:UpdateAccountDetailsRequest"/>
            <output message="target:UpdateAccountDetailsResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="UpdateAccountSerialNumber">
            <input message="target:UpdateAccountSerialNumberRequest"/>
            <output message="target:UpdateAccountSerialNumberResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="QueryNamesForNumbers">
            <input message="target:QueryNamesForNumbersRequest"/>
            <output message="target:QueryNamesForNumbersResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>
        <operation name="SetNamesForNumbersList">
		    <input message="target:SetNamesForNumbersListRequest"/>
		    <output message="target:SetNamesForNumbersListResponse"/>
		    <fault message="fault:SystemFault" name="SystemFault"/>
		    <fault message="fault:SecurityFault" name="SecurityFault"/>
		    <fault message="fault:ValidationFault" name="ValidationFault"/>
		    <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
		</operation>        		
        <operation name="RecordBondPayment">
		    <input message="target:RecordBondPaymentRequest"/>
		    <output message="target:RecordBondPaymentResponse"/>
		    <fault message="fault:SystemFault" name="SystemFault"/>
		    <fault message="fault:SecurityFault" name="SecurityFault"/>
		    <fault message="fault:ValidationFault" name="ValidationFault"/>
		    <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
		</operation>        		
        <operation name="AddRegisteredCard">
		    <input message="target:AddRegisteredCardRequest"/>
		    <output message="target:AddRegisteredCardResponse"/>
		    <fault message="fault:SystemFault" name="SystemFault"/>
		    <fault message="fault:SecurityFault" name="SecurityFault"/>
		    <fault message="fault:ValidationFault" name="ValidationFault"/>
		    <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
		</operation>    
		
		<operation name="CancelRegisteredCard">
		    <input message="target:CancelRegisteredCardRequest"/>
		    <output message="target:CancelRegisteredCardResponse"/>
		    <fault message="fault:SystemFault" name="SystemFault"/>
		    <fault message="fault:SecurityFault" name="SecurityFault"/>
		    <fault message="fault:ValidationFault" name="ValidationFault"/>
		    <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
		</operation> 
		
        <operation name="SetAccountSerialNumber">
            <input message="target:SetAccountSerialNumberRequest"/>
            <output message="target:SetAccountSerialNumberResponse"/>
            <fault message="fault:SystemFault" name="SystemFault"/>
            <fault message="fault:SecurityFault" name="SecurityFault"/>
            <fault message="fault:ValidationFault" name="ValidationFault"/>
            <fault message="fault:ServiceUnavailableFault" name="ServiceUnavailableFault"/>
        </operation>   		

    </portType>
</definitions>
